# Data engineering syntax assessment

## Question 1

In [1]:
import pandas as pd

Create a `DataFrame` object STUDENTS.

In [2]:
STUDENTS = pd.DataFrame({"name": ["Andy", "Jose", "Dieu", "Chloe", "Jose"],
                         "continent": ["America", "Europe", "Aisa", "America", "Europe"],
                         "college": ["Lib Arts", "Business", "Engineering", "Engineering", "Business"]})
STUDENTS

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Aisa  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

(A) De-dup STUDENTS

In [3]:
# Answer for (A)
STUDENTS.drop_duplicates(inplace=True)
STUDENTS

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Aisa  Engineering
3  Chloe   America  Engineering

(B) Create a data frame COUNTS storing the count of students for each continent, college pair

(C) Pivot COUNTS so that continent values become column names

(D) If applicable, remove any unnecessary index levels created in part C

(E) Zero-fill missing values in COUNTS

(F) Sort COUNTS reverse alphabetically by college name

In [4]:
# Answer for (B) ~ (F)
COUNTS = STUDENTS.pivot_table(values="name", index="college", 
                              columns="continent", aggfunc="size", 
                              fill_value=0).sort_index(ascending=False)
COUNTS

continent    Aisa  America  Europe
college
Lib Arts        0        1       0
Engineering     1        1       0
Business        0        0       1

## Question 2

(A) Option A) is correct.

In [5]:
df = pd.DataFrame({"eggs": [47, 110, 221, 77, 132, 205],
                   "salt": [12., 50., 89., 87., 0., 60.],
                   "spam": [17, 31, 72, 20, 52, 55],
                   "month": ["jan", "feb", "mar", "apr", "may", "jun"]})
df.set_index("month", inplace=True)
df

       eggs  salt  spam
month
jan      47  12.0    17
feb     110  50.0    31
mar     221  89.0    72
apr      77  87.0    20
may     132   0.0    52
jun     205  60.0    55

In [6]:
(df.loc[["apr", "may", "jun"],]["eggs"] > 100).sum()

2

(B) Option A) is correct.

In [7]:
import datetime

datetime.datetime.strptime("01012018", "%d%m%Y").date()

datetime.date(2018, 1, 1)

(C) Option A) is correct.

In [8]:
from sklearn.datasets import load_iris
data = load_iris()
feature_names = ["Sepal.Length", "Sepal.Width", "Petal.Length", "Petal.Width"]
iris = pd.DataFrame(data=data.data, columns=feature_names)
iris['Species'] = data.target_names[data.target]
iris

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [9]:
iris[(iris["Species"] == 2) & (iris["Petal.Width"] > 2)].sort_values("Sepal.Length", ascending=False)

Empty DataFrame
Columns: [Sepal.Length, Sepal.Width, Petal.Length, Petal.Width, Species]
Index: []